app/controllers/friends_controller.rb

  def create
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["first_name", "ctdd"], ["last_name", ""], ["email", ""], ["phone", ""], ["twitter", ""], ["created_at", "2022-05-27 22:29:11.349149"], ["updated_at", "2022-05-27 22:29:11.349149"], ["user_id", 6]]

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "first_name" = ?, "last_name" = ?, "email" = ?, "phone" = ?, "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["first_name", "John"], ["last_name", "Doe"], ["email", "johndoe22@hy.com"], ["phone", "222 234 1112"], ["twitter", "@John"], ["updated_at", "2022-05-28 18:45:32.772639"], ["id", 1]]